#include <iostream>
using namespace std;

int main()
{
    // задача Begin 39
    cout << "Задача 39" << "\n";
    
    // декларація змінних
    double швидкість_км_год, швидкість_м_с;
    
    // введення змінної
    cout << "Введіть швидкість у км/год: ";
    cin >> швидкість_км_год;
    
    // розрахунок результату
    швидкість_м_с = швидкість_км_год * 1000 / 3600;
    
    // вивід результату
    cout << "Швидкість у м/с: " << швидкість_м_с << "\n";
    
    // задача Begin 18
    cout << "\n";
    cout << "Задача 18" << "\n";

    // декларація змінних
    double A, A2, A4, A8;

    // введення змінної
    cout << "Введіть число A: ";
    cin >> A;
    
    // розрахунок результату
    A2 = A * A;
    A4 = A2 * A2;
    A8 = A4 * A4;
    
    // вивід результату
    cout << "A^2 = " << A2 << "\n";
    cout << "A^4 = " << A4 << "\n";
    cout << "A^8 = " << A8 << "\n";
    
    // задача Begin 23
    cout << "\n";
    cout << "Задача 23" << "\n";

    // декларація змінних
    double цельсій, фаренгейт;

    // введення змінної
    cout << "Введіть температуру у градусах Цельсія: ";
    cin >> цельсій;

    // розрахунок результату
    фаренгейт = цельсій * 9 / 5 + 32;

    // вивід результату
    cout << "Температура у градусах Фаренгейта: " << фаренгейт << "\n";
    
    return 0;
}
